In [2]:
import pandas as pd

# Create a Series using a Python dictionary
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)

area_dict = {'California': 423967, 
             'Texas': 695662, 
             'New York': 141297,
             'Florida': 170312, 
             'Illinois': 149995}
area = pd.Series(area_dict)

#Create a data frame with columns from the individual series. Note that a DataFrame is a collection of Series
states = pd.DataFrame({'population': population, 'area': area})

states

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [10]:
states.loc['California']

area            423967
population    38332521
Name: California, dtype: int64

In [11]:
states[0:2]

              area  population
California  423967    38332521
Florida     170312    19552860

In [12]:
# Note that when slicing with key values, the end key is returned, unlike when using index position
states['California':'Illinois']

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135

In [15]:
# Transpose rows and columns
states.T

            California   Florida  Illinois  New York     Texas
area            423967    170312    149995    141297    695662
population    38332521  19552860  12882135  19651127  26448193

In [16]:
states

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [18]:
states.iloc[:3, 1:]

            population
California    38332521
Florida       19552860
Illinois      12882135